УТ_для_edt/src/DataProcessors/CRM_РаботаСМессенджеромWhatsApp/CRM_РаботаСМессенджеромWhatsApp.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_РаботаСМессенджеромWhatsApp</name>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ApiURL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресурс</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресWebhook</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Провайдер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

УТ_для_edt/src/Documents/CRM_СообщениеМессенджера/CRM_СообщениеМессенджера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_СообщениеМессенджера</name>
  <posting>Deny</posting>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ID_Пользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_Сообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.CRM_ВидыСообщенияМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Диалог</name>
    <type>
      <types>CatalogRef.CRM_Диалоги</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОснование</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

УТ_для_edt/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерТелефона</name>
    <comment>#1651 смарт: Лопато / Телефония. Хранение истории контактной информации пользователей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОписание</name>
    <comment>#1776 смарт: Ермаков 19.04.2024 / Телефон в карточке пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/CRM_РаботаСМессенджеромWhatsApp/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбязательныеМетодыПрограмногоИнтерфейса

Функция ПолучитьСообщения(УчетнаяЗапись) Экспорт
	
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	Если СтруктураПараметровДоступа = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если СтруктураПараметровДоступа.Свойство("Провайдер") И СтруктураПараметровДоступа.Провайдер = 1 Тогда
		Возврат ПолучитьСообщенияGreen(УчетнаяЗапись, СтруктураПараметровДоступа);
	Иначе
		Возврат ПолучитьСообщенияChat(УчетнаяЗапись, СтруктураПараметровДоступа);
	КонецЕсли;
	
КонецФункции

Функция ОтправитьСообщение(знач Сообщение, УчетнаяЗапись, IDПользователя, СписокФайлов, ДопПараметры) Экспорт
	
	// +Рарус alexpr
	//Возврат CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ОтправитьСообщениеМессенджера(Сообщение,
	//	 УчетнаяЗапись, IDПользователя, СписокФайлов,
	//	 ДопПараметры);
	Возврат CRM_ЛицензированиеЭкспортныеМетодыНовый.ПолучитьЗащищеннуюОбработку().ОтправитьСообщениеМессенджера(Сообщение,
		 УчетнаяЗапись, IDПользователя, СписокФайлов,
		 ДопПараметры);
	// -Рарус alexpr
	
КонецФункции

Процедура ОжиданиеСобытий(УчетнаяЗапись) Экспорт

	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	
	Если СтруктураПараметровДоступа.Свойство("Провайдер") И СтруктураПараметровДоступа.Провайдер = 1 Тогда
		ОжиданиеСобытийGreen(УчетнаяЗапись, СтруктураПараметровДоступа);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВидКИМессенджера(Контакт) Экспорт
	
	Наименование = "WhatsApp";
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыКонтактнойИнформации.Ссылка КАК Ссылка,
	                      |	ВидыКонтактнойИнформации.ПометкаУдаления КАК ПометкаУдаления
	                      |ИЗ
	                      |	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	                      |ГДЕ
	                      |	ВидыКонтактнойИнформации.Наименование = &Наименование
	                      |	И ВидыКонтактнойИнформации.Тип = &Тип
	                      |	И ВидыКонтактнойИнформации.Родитель = &Родитель");
	
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
		Родитель = Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		Родитель = Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		Родитель = Справочники.ВидыКонтактнойИнформации.СправочникCRM_ПотенциальныеКлиенты;
	КонецЕсли;
	
	ТипКИ = ТипКИМессенджера();
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Тип", ТипКИ);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ПометкаУдаления Тогда
			Выборка.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		Возврат Выборка.Ссылка;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		НовыйВидКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовыйВидКИ.Родитель = Родитель;
		НовыйВидКИ.Наименование = Наименование;
		НовыйВидКИ.Тип = ТипКИ;
		НовыйВидКИ.Используется = Истина;
		НовыйВидКИ.ВидРедактирования = "Диалог";
		НовыйВидКИ.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		Возврат НовыйВидКИ.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ТипКИМессенджера() Экспорт
	
	Возврат Перечисления.ТипыКонтактнойИнформации.Телефон;
	
КонецФункции

Функция НачалоАдресаСтраницыПользователя() Экспорт
	Возврат "";
КонецФункции

Функция ПутьКДиалогуВБраузере(Структура) Экспорт
	Возврат "";
КонецФункции

Функция ПредставлениеКонтактнойИнформацииПользователя(ID_Пользователя) Экспорт
	Возврат Лев(ID_Пользователя, СтрНайти(ID_Пользователя, "@") - 1);
КонецФункции

Функция ВозможноИзменениеСообщений() Экспорт
	Возврат Ложь; 
КонецФункции

Функция ИспользуютсяВложения() Экспорт
	Возврат Истина; 
КонецФункции

Функция HTMLКонтекста(УчетнаяЗапись, idПользователя, idГруппы) Экспорт
	Возврат Неопределено; 
КонецФункции

Функция Отключиться(СтруктураПараметровДоступа) Экспорт
	Возврат Истина;
КонецФункции

Процедура ПометитьКакПрочтенные(УчетнаяЗапись, МассивСообщений) Экспорт
	
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	Если СтруктураПараметровДоступа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураПараметровДоступа.Свойство("Провайдер") И СтруктураПараметровДоступа.Провайдер = 1 Тогда
		ПометитьКакПрочтенныеGreen(СтруктураПараметровДоступа, МассивСообщений);
	Иначе	
		ПометитьКакПрочтенныеChat(СтруктураПараметровДоступа, МассивСообщений);
	КонецЕсли;
	
КонецПроцедуры

Функция ОбработатьWebhook(УчетнаяЗапись, ТелоЗапроса) Экспорт
	
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	Если СтруктураПараметровДоступа = Неопределено Тогда
		ДанныеОтвета = Новый Структура("error", "Сервис не найден!");
		Ответ = CRM_РаботаСМессенджерамиСервер.HTTPОтвет(ДанныеОтвета);
		Возврат Ответ; 
	КонецЕсли;
	Если СтруктураПараметровДоступа.Свойство("Провайдер") И СтруктураПараметровДоступа.Провайдер = 1 Тогда
		Возврат ОбработатьWebhookGreen(УчетнаяЗапись, ТелоЗапроса, СтруктураПараметровДоступа);
	Иначе	
		Возврат ОбработатьWebhookChat(УчетнаяЗапись, ТелоЗапроса, СтруктураПараметровДоступа);
	КонецЕсли;
КонецФункции

Функция УстановитьWebhook(УчетнаяЗапись, СтруктураПараметровДоступа) Экспорт
	Если СтруктураПараметровДоступа.Свойство("Провайдер") И СтруктураПараметровДоступа.Провайдер = 1 Тогда
		Возврат УстановитьWebhookGreen(УчетнаяЗапись, СтруктураПараметровДоступа);
	Иначе	
		Возврат УстановитьWebhookChat(УчетнаяЗапись, СтруктураПараметровДоступа);
	КонецЕсли;
КонецФункции

Функция ПользовательДоступен(УчетнаяЗапись, НомерТелефона) Экспорт
	
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	
	Если СтруктураПараметровДоступа = Неопределено Тогда
		Возврат Новый Структура("Доступен, Описание",
		 Ложь,
		 "");
	КонецЕсли;
	
	Если СтруктураПараметровДоступа.Свойство("Провайдер") И СтруктураПараметровДоступа.Провайдер = 1 Тогда
		Возврат ПользовательДоступенGreen(УчетнаяЗапись, НомерТелефона, СтруктураПараметровДоступа);
	Иначе	
		Возврат ПользовательДоступенChat(УчетнаяЗапись, НомерТелефона, СтруктураПараметровДоступа);
	КонецЕсли;
	
КонецФункции

Функция ПараметрыМессенджера() Экспорт
	
    ПараметрыМессенджера = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровМессенджера();
	
	Возврат ПараметрыМессенджера;
	
КонецФункции

#КонецОбласти

Процедура ПроверитьПодключение(ПараметрыПроверки, ПараметрыПрокси) Экспорт
	
	Если ПараметрыПроверки.Провайдер = 0 Тогда
		РесурсТемп = ПараметрыПроверки.Ресурс + "settings?token=" + ПараметрыПроверки.Токен;
		СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(ПараметрыПроверки.Сервер,
			 , РесурсТемп, ПараметрыПрокси,
			 "x-www-form-urlencoded"));
	ИначеЕсли ПараметрыПроверки.Провайдер = 1 Тогда
		СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(СерверGreen(), ,
			URLМетодаСервисаGreen(ПараметрыПроверки.ApiURL, ПараметрыПроверки.Токен, "getStateInstance"), ПараметрыПрокси));
	КонецЕсли;
	
КонецПроцедуры

// Метод предназначен для получения QR-кода. Для авторизации аккаунта требуется считать QR-код из приложения
// WhatsApp Business на телефоне. Также получить QR-код и авторизовать аккаунт можно в личном кабинете. 
// Процедура авторизации аккаунта через личный кабинет описана в разделе Перед началом работы.
// Подробнее https://green-api.com/docs/api/account/QR/
// 
// Возвращаемое значение:
//  ЧтениеJSON  - Ответ сервера
//
Функция ПолучитьQRКод(Параметры, ПараметрыПрокси) Экспорт

	СтруктураОтвета = Неопределено;
	Если Параметры.Провайдер = 0 Тогда
		
	ИначеЕсли Параметры.Провайдер = 1 Тогда
		СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(СерверGreen(), ,
			URLМетодаСервисаGreen(Параметры.ApiURL, Параметры.Токен, "qr"), ПараметрыПрокси));
	КонецЕсли;
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ВключитьВыключитьЗагрузкуВидео(Токен, Сервер, Ресурс, Загружать, ПараметрыПрокси) Экспорт
	
	Попытка
		РесурсТемп = Ресурс + "settings?&token=" + Токен;
		ДанныеЗапроса = Новый Структура();
		ДанныеЗапроса.Вставить("videoUploadOn", Загружать);
		Запрос = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(ДанныеЗапроса, Истина);

		СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер,
			 Запрос, РесурсТемп, ПараметрыПрокси,
			 "json"));
		Если СтруктураОтвета.Свойство("error") Тогда
			ВызватьИсключение СтруктураОтвета.error;
		Иначе
			Возврат Истина;
		КонецЕсли;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ЗагрузкаВидео(Токен, Сервер, Ресурс, ПараметрыПрокси) Экспорт
	
	Попытка
		РесурсТемп = Ресурс + "settings?&token=" + Токен;
		СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер,
			 , РесурсТемп, ПараметрыПрокси,
			 "x-www-form-urlencoded"));
		Если СтруктураОтвета.videoUploadOn = Неопределено ИЛИ Не СтруктураОтвета.videoUploadOn Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#Область ChatApi

Функция ПолучитьСообщенияChat(УчетнаяЗапись, СтруктураПараметровДоступа) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МАКСИМУМ(CRM_СообщениеМессенджера.Дата) КАК Дата
	                      |ИЗ
	                      |	Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
	                      |ГДЕ
	                      |	CRM_СообщениеМессенджера.Диалог.УчетнаяЗапись = &УчетнаяЗапись");
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Выборка = Запрос.Выполнить().Выбрать();
	Ресурс = СтруктураПараметровДоступа.Ресурс + "messages?last=true&token=" + СтруктураПараметровДоступа.Токен;
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Дата) Тогда
		Ресурс = СтрЗаменить(Ресурс, "last=true", "min_time=" + Формат(Выборка.Дата - Дата(1970, 1,
			 1) - (ТекущаяДата() - ТекущаяУниверсальнаяДата()),
			 "ЧДЦ=0; ЧГ=0"));
	КонецЕсли;
	
	МассивСообщений = Новый Массив;
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(СтруктураПараметровДоступа.Сервер,
		 "",
		Ресурс, СтруктураПараметровДоступа.ПараметрыПрокси));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error;
	Иначе
		ЗаполнитьСообщенияChat(УчетнаяЗапись, СтруктураОтвета.messages, МассивСообщений);
	КонецЕсли;
	Возврат МассивСообщений;
	
КонецФункции

Процедура ЗаполнитьСообщенияChat(УчетнаяЗапись, Сообщения, МассивСообщений)
	
	Для каждого ТекСообщение из Сообщения Цикл
		Дата = МестноеВремя(Дата(1970, 1, 1) + Число(ТекСообщение.time));
		Если Не ТекСообщение.fromMe Тогда
			Телефон = Лев(ТекСообщение.author, СтрНайти(ТекСообщение.author, "@") - 1);
			Контакт = CRM_РаботаСМессенджерамиСерверПовтИсп.НайтиКонтактПоКонтактнойИнформации(Телефон,
				 УчетнаяЗапись,
				 Перечисления.ТипыКонтактнойИнформации.Телефон);
		Иначе
			Контакт = Неопределено;
		КонецЕсли;	
			Сообщение = CRM_РаботаСМессенджерамиСервер.СтруктураСообщенияМесенджера();
			Сообщение.Дата = Дата;
			Сообщение.ID_Сообщения = ТекСообщение.id;
			Если ТекСообщение.type = "chat" ИЛИ ТекСообщение.type = "vcard"
				ИЛИ ТекСообщение.type = "location" Тогда
				Сообщение.ТекстСообщения = ТекСообщение.body;
			ИначеЕсли ТекСообщение.type = "call_log" Тогда
				Если ТекСообщение.body = "[Call - miss]" Тогда
					Сообщение.ТекстСообщения = НСтр("ru = '[Пропущенный аудиозвонок]'");
				Иначе
					Сообщение.ТекстСообщения = ТекСообщение.body;
				КонецЕсли;
			Иначе
				Если ТекСообщение.Свойство("caption") Тогда
					Сообщение.ТекстСообщения = ТекСообщение.caption;
				КонецЕсли;
			КонецЕсли;
			Если ТекСообщение.fromMe Тогда
				Сообщение.ВидСообщения = "Исходящее";
				Если СтрНайти(ТекСообщение.chatId, "-") = 0 Тогда
					Сообщение.ID_Пользователя = ТекСообщение.chatId;
				Иначе	
					Сообщение.ID_Пользователя = ТекСообщение.author;
				КонецЕсли;
			Иначе
				Сообщение.ВидСообщения = "Входящее";
				Сообщение.ID_Пользователя = ТекСообщение.author;
			КонецЕсли;
			Телефон = ПредставлениеКонтактнойИнформацииПользователя(Сообщение.ID_Пользователя);
			Контакт = CRM_РаботаСМессенджерамиСерверПовтИсп.НайтиКонтактПоКонтактнойИнформации(Телефон,
				 УчетнаяЗапись,
				 Перечисления.ТипыКонтактнойИнформации.Телефон);
			Если ЗначениеЗаполнено(Контакт) Тогда
				Сообщение.Контакт = Контакт;
			КонецЕсли;
			Сообщение.КонтактПредставление = ТекСообщение.senderName;
			Сообщение.Группа = ТекСообщение.chatId;
			Сообщение.ГруппаПредставление = ТекСообщение.chatName;
			Если ТекСообщение.Свойство("quotedMsgId") И ЗначениеЗаполнено(ТекСообщение.quotedMsgId) Тогда
				Сообщение.ID_СообщенияОснования = ТекСообщение.quotedMsgId;
			КонецЕсли;
			
			Если ТекСообщение.type <> "chat" И ТекСообщение.type <> "call_log"
				И ТекСообщение.type <> "vcard" И ТекСообщение.type <> "location" Тогда
				Попытка
					КаталогВременныхФайлов = КаталогВременныхФайлов();
					ПутьКФайлу = ТекСообщение.body;
					ИмяФайла = РаскодироватьСтроку(ПутьКФайлу, СпособКодированияСтроки.URLВКодировкеURL);
					ПозицияВопроса = СтрНайти(ИмяФайла, "?");
					НачалоИмени = СтрНайти(РаскодироватьСтроку(ИмяФайла, СпособКодированияСтроки.URLВКодировкеURL),
						 "/", НаправлениеПоиска.СКонца,
						?(ПозицияВопроса = 0, Неопределено, ПозицияВопроса));
					ИмяФайла = Сред(ИмяФайла, НачалоИмени + 1, ?(ПозицияВопроса = 0, СтрДлина(ИмяФайла),
						 ПозицияВопроса - НачалоИмени - 1));
					ТретийСлеш = СтрНайти(ПутьКФайлу, "/", , , 3);
					Соединение = Новый HTTPСоединение(СтрЗаменить(Лев(ПутьКФайлу, ТретийСлеш - 1), "https://", ""),
						 , , , , 20,
						 Новый ЗащищенноеСоединениеOpenSSL);
					Соединение.Получить(Сред(ПутьКФайлу, ТретийСлеш + 1), КаталогВременныхФайлов + ИмяФайла);
					Данные = Новый ДвоичныеДанные(КаталогВременныхФайлов + ИмяФайла);
					АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(Данные);
					ПараметрыФайла = Новый Структура;
					ПараметрыФайла.Вставить("ВладелецФайлов", Неопределено);
					ПараметрыФайла.Вставить("Автор", Неопределено);
					ПараметрыФайла.Вставить("ИмяБезРасширения", Лев(ИмяФайла, СтрНайти(ИмяФайла, ".") - 1));
					ПараметрыФайла.Вставить("РасширениеБезТочки", Сред(ИмяФайла, СтрНайти(ИмяФайла, ".") + 1));
					ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
					ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
					ПараметрыФайла.Вставить("АдресФайлаВХранилище", АдресФайлаВХранилище);
					Сообщение.Вложения.Добавить(ПараметрыФайла);
					УдалитьФайлы(КаталогВременныхФайлов + ИмяФайла);
				Исключение
					ИнформацияОбОшибке		= ИнформацияОбОшибке();
					ОсноваСообщенияОшибки	= НСтр("ru = 'Не удалось загрузить вложение.'; en = 'Failed to upload attachment.'");
					
					ЗаписьЖурналаРегистрации(
						"CRM_РаботаСМессенджеромWhatsApp.ЗаполнитьСообщенияChat",
						УровеньЖурналаРегистрации.Предупреждение,
						Обработки.CRM_РаботаСМессенджеромWhatsApp, ,
						ОсноваСообщенияОшибки + " <" + ТекСообщение.body + ">" + Символы.ПС + ИнформацияОбОшибке.Описание);
					
					ШаблонHTMLОшибки = "<i>%1</i>";
					
					Сообщение.ТекстHTML = СтрШаблон(ШаблонHTMLОшибки, ОсноваСообщенияОшибки + " " 
						+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
				КонецПопытки;
			КонецЕсли;
			
			МассивСообщений.Добавить(Сообщение);
	КонецЦикла;
	
КонецПроцедуры

Функция УстановитьWebhookChat(УчетнаяЗапись, СтруктураПараметровДоступа)
	АдресWebhook = СтруктураПараметровДоступа.АдресWebhook;
	АдресWebhook = АдресWebhook + ?(Прав(АдресWebhook, 1) = "/", "", "/") 
		+ Строка(УчетнаяЗапись.Ссылка.УникальныйИдентификатор());
	Ресурс = СтруктураПараметровДоступа.Ресурс + "webhook?token=" + СтруктураПараметровДоступа.Токен;
	ДанныеЗапроса = Новый Структура();
	ДанныеЗапроса.Вставить("webhookUrl", АдресWebhook);
	Запрос = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(ДанныеЗапроса, Истина);

	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(СтруктураПараметровДоступа.Сервер,
		 Запрос, Ресурс,
		 СтруктураПараметровДоступа.ПараметрыПрокси));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error;
	ИначеЕсли СтруктураОтвета.Свойство("set") Тогда
		Возврат СтруктураОтвета.set;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция ОбработатьWebhookChat(УчетнаяЗапись, ТелоЗапроса, СтруктураПараметровДоступа) Экспорт
	
	ДанныеХука = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(ТелоЗапроса);
	
	Если ДанныеХука.Свойство("messages") Тогда
		МассивСообщений = Новый Массив;
		ЗаполнитьСообщенияChat(УчетнаяЗапись, ДанныеХука.messages, МассивСообщений);
		CRM_РаботаСМессенджерамиСервер.СоздатьСообщенияИзПолученныхДанных(УчетнаяЗапись, МассивСообщений);
	КонецЕсли;
	
	ДанныеОтвета = Новый Структура("status", "ок");
	Ответ = CRM_РаботаСМессенджерамиСервер.HTTPОтвет(ДанныеОтвета);
	Возврат Ответ;
	
КонецФункции

Процедура ПометитьКакПрочтенныеChat(СтруктураПараметровДоступа, МассивСообщений) Экспорт
	
	Возврат; // метод не поддерживаетсz ChatApi
	
	МассивЧатов = Новый Массив;
	Для каждого Сообщение из МассивСообщений Цикл
		Если МассивЧатов.Найти(Сообщение.Группа) = Неопределено Тогда
			МассивЧатов.Добавить(Сообщение.Группа);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Чат из МассивЧатов Цикл
		Ресурс = СтруктураПараметровДоступа.Ресурс + "readChat?chatId=" + Чат + "&token=" + СтруктураПараметровДоступа.Токен;
		СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(СтруктураПараметровДоступа.Сервер,
			 "", Ресурс,
			 СтруктураПараметровДоступа.ПараметрыПрокси));
		Если СтруктураОтвета.Свойство("error") Тогда
			ВызватьИсключение СтруктураОтвета.error;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПользовательДоступенChat(УчетнаяЗапись, НомерТелефона, СтруктураПараметровДоступа) Экспорт
	
	Результат = Новый Структура("Доступен, Описание", Ложь, "");
	
	ШаблонСтрокиЗапроса = "%1contacts?token=%2";
	Ресурс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиЗапроса,
					СтруктураПараметровДоступа.Ресурс, СтруктураПараметровДоступа.Токен);
	
	НомераТелефонов = Новый Массив;
	НомераТелефонов.Добавить(НомерТелефона);
	Структура = Новый Структура;
	Структура.Вставить("contacts", НомераТелефонов);				
	
	СтрокаЗапроса = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(Структура, Истина);
	
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(СтруктураПараметровДоступа.Сервер,
		 СтрокаЗапроса, Ресурс,
	СтруктураПараметровДоступа.ПараметрыПрокси));

	Если СтруктураОтвета.Свойство("error") Тогда
		ШаблонОписания = НСтр("ru = 'Результат поиска в мессенджерах номера %1 от учетной записи %2: %3'");
		Результат.Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОписания,
			 НомерТелефона, УчетнаяЗапись,
			 СтруктураОтвета.error);
		Возврат Результат;
	Иначе
		Если СтруктураОтвета.Свойство("contacts") И СтруктураОтвета.contacts.Количество() > 0
			 И СтруктураОтвета.contacts[0].status <> "valid" Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Результат.Доступен = Истина;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область GreenApi

Функция ПолучитьСообщенияGreen(УчетнаяЗапись, СтруктураПараметровДоступа) Экспорт
	
	МассивСообщений = Новый Массив;
	ЗаполнитьСообщенияGreenПоОповещениям(УчетнаяЗапись, СтруктураПараметровДоступа, МассивСообщений);
	Возврат МассивСообщений;
	
КонецФункции

Процедура ЗаполнитьСообщенияGreenПоОповещениям(УчетнаяЗапись, СтруктураПараметровДоступа, МассивСообщений)
	
	Сервер = СерверGreen();
	Ресурс = URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL, СтруктураПараметровДоступа.Токен,
		 "receiveNotification");
	
	ТипыУведомлений = Новый Структура;
	ТипыУведомлений.Вставить("ВходящееСообщение", "incomingMessageReceived");
	ТипыУведомлений.Вставить("ИсходящееСообщение", "outgoingMessageReceived"); // Отправленное с телефона сообщение
	ТипыУведомлений.Вставить("СтатусОтправленногоСообщения", "outgoingMessageStatus");
	ТипыУведомлений.Вставить("СостояниеАккаунта", "stateInstanceChanged");
	ТипыУведомлений.Вставить("СостояниеТелефона", "deviceInfo");

	Ошибок = 0;
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер,
		 "", Ресурс, СтруктураПараметровДоступа.ПараметрыПрокси,
		 ""));
	Пока ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("body") Цикл
		ТекстСообщения = Неопределено;
		idОповещения = Формат(СтруктураОтвета.receiptId, "ЧГ=0");
			
		Отказ = Ложь;
		Оповещение = СтруктураОтвета.body;
		
		ЭтоВходящееСообщение = (Оповещение.typeWebhook = ТипыУведомлений.ВходящееСообщение);
		ЭтоИсходящееСообщение  = (Оповещение.typeWebhook = ТипыУведомлений.ИсходящееСообщение);
		
		Если ЭтоВходящееСообщение Или ЭтоИсходящееСообщение Тогда
			Сообщение = CRM_РаботаСМессенджерамиСервер.СтруктураСообщенияМесенджера();
			Сообщение.Дата = МестноеВремя(Дата(1970, 1, 1) + Оповещение.timestamp);

			Если ЭтоВходящееСообщение Тогда
				user_id = Оповещение.senderData.sender;
			ИначеЕсли ЭтоИсходящееСообщение Тогда
				user_id = Оповещение.senderData.chatId;
			КонецЕсли;
			Контакт = CRM_РаботаСМессенджерамиСерверПовтИсп.НайтиКонтактПоКонтактнойИнформации(ПредставлениеКонтактнойИнформацииПользователя(user_id),
					УчетнаяЗапись, Перечисления.ТипыКонтактнойИнформации.Телефон);
			ИмяПользователя = Оповещение.senderData.senderName;
			Сообщение.ID_Сообщения = Оповещение.idMessage;
			
			Если ЭтоВходящееСообщение Тогда
				Сообщение.ВидСообщения = "Входящее";
			ИначеЕсли ЭтоИсходящееСообщение Тогда
				Сообщение.ВидСообщения = "Исходящее";
			КонецЕсли;
				
			Сообщение.ID_Пользователя = user_id;
			Сообщение.Группа = user_id;
			Если ЗначениеЗаполнено(Контакт) Тогда
				Сообщение.Контакт = Контакт;
			КонецЕсли;
			
			Если ЭтоВходящееСообщение Тогда
				Сообщение.КонтактПредставление = ИмяПользователя;
			ИначеЕсли ЭтоИсходящееСообщение Тогда
				
				Если ТипЗнч(Контакт) <> Тип("Строка") Тогда
					Сообщение.КонтактПредставление = Строка(Контакт);
				Иначе
					Сообщение.КонтактПредставление = Контакт;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Оповещение.messageData.typeMessage = "quotedMessage"
				 И Оповещение.messageData.extendedTextMessageData.Свойство("stanzaId") Тогда
				Сообщение.ID_СообщенияОснования = Оповещение.messageData.extendedTextMessageData.stanzaId;
			КонецЕсли;
			
			Если Оповещение.messageData.typeMessage = "imageMessage"
				Или Оповещение.messageData.typeMessage = "videoMessage"
				Или Оповещение.messageData.typeMessage = "documentMessage"
				Или Оповещение.messageData.typeMessage = "audioMessage" Тогда
				
				Если Оповещение.messageData.typeMessage = "documentMessage" Тогда
					ИмяФайла = Оповещение.messageData.fileMessageData.fileName;
				Иначе
					ИмяФайла = "";
				КонецЕсли;
				
				Если Не ПустаяСтрока(Оповещение.messageData.fileMessageData.downloadUrl) Тогда
					ПараметрыФайла = СкачатьФайлПоСсылке(Оповещение.messageData.fileMessageData.downloadUrl, ИмяФайла);
					Сообщение.Вложения.Добавить(ПараметрыФайла);
					
					Если Оповещение.messageData.fileMessageData.Свойство("caption") Тогда
						Сообщение.ТекстСообщения = Оповещение.messageData.fileMessageData.caption;
					КонецЕсли;
				Иначе
					Сообщение.ТекстСообщения = НСтр("ru = 'Ошибка загрузки вложения! В сообщении отсутствует адрес файла.'");
				КонецЕсли;
				
			ИначеЕсли Оповещение.messageData.Свойство("extendedTextMessageData") Тогда
				ТемпТекст = "";
				Если Оповещение.messageData.extendedTextMessageData.Свойство("title") Тогда
					ТемпТекст = ТемпТекст + Оповещение.messageData.extendedTextMessageData.title;
				КонецЕсли;
				Если Оповещение.messageData.extendedTextMessageData.Свойство("text") Тогда
					ТемпТекст = ТемпТекст + Символы.ПС + Оповещение.messageData.extendedTextMessageData.text;
				КонецЕсли;
				Если Оповещение.messageData.extendedTextMessageData.Свойство("jpegThumbnail")
						И ЗначениеЗаполнено(Оповещение.messageData.extendedTextMessageData.jpegThumbnail) Тогда
					ПараметрыФайла = ФайлJpegПоДанным(Оповещение.messageData.extendedTextMessageData.jpegThumbnail);
					Сообщение.Вложения.Добавить(ПараметрыФайла);
				КонецЕсли;
				Сообщение.ТекстСообщения = ТемпТекст;
			ИначеЕсли Оповещение.messageData.typeMessage = "contactMessage" Тогда
				Сообщение.ТекстСообщения = Оповещение.messageData.contactMessageData.vcard;
				
			ИначеЕсли Оповещение.messageData.typeMessage = "contactsArrayMessage" Тогда
				
				МассивКонтактов = Оповещение.messageData.messageData.contacts;
				МассивСообщенийКонтактов = Новый Массив;
				Для Каждого ТекКонтакт Из МассивКонтактов Цикл
					МассивСообщенийКонтактов.Добавить(ТекКонтакт.displayName);
					МассивСообщенийКонтактов.Добавить(ТекКонтакт.vcard);
					МассивСообщенийКонтактов.Добавить("");
				КонецЦикла;
				
				Сообщение.ТекстСообщения = СтрСоединить(МассивСообщенийКонтактов, Символы.ПС);
				
			ИначеЕсли Оповещение.messageData.typeMessage = "locationMessage" Тогда	
				Сообщение.ТекстСообщения    = СтрШаблон("https://yandex.ru/maps/?pt=%1,%2&z=18&l=map"
				, Формат(Оповещение.messageData.locationMessageData.longitude, "ЧРД=.")
				, Формат(Оповещение.messageData.locationMessageData.latitude, "ЧРД=." ));
				
			ИначеЕсли Оповещение.messageData.typeMessage = "templateMessage" Тогда // сообщение с шаблонными кнопками 
				Сообщение.ТекстСообщения = Оповещение.messageData.templateMessage.contentText;
				
			ИначеЕсли Оповещение.messageData.typeMessage = "buttonsMessage" Тогда // сообщение с кнопками 
				Сообщение.ТекстСообщения = Оповещение.messageData.buttonsMessage.contentText;
				
			ИначеЕсли Оповещение.messageData.typeMessage = "stickerMessage" Тогда
				ПозицияПоследнегоРазделителя = СтрНайти(Оповещение.messageData.fileMessageData.downloadUrl, "/",
					 НаправлениеПоиска.СКонца);
				ИмяФайла = Прав(Оповещение.messageData.fileMessageData.downloadUrl,
					 СтрДлина(Оповещение.messageData.fileMessageData.downloadUrl) - ПозицияПоследнегоРазделителя); 
				
				Если Не ПустаяСтрока(Оповещение.messageData.fileMessageData.downloadUrl) Тогда
					ПараметрыФайла = СкачатьФайлПоСсылке(Оповещение.messageData.fileMessageData.downloadUrl, ИмяФайла);
					Сообщение.Вложения.Добавить(ПараметрыФайла);
				Иначе
					Сообщение.ТекстСообщения = НСтр("ru = 'Ошибка загрузки стикера! В сообщении отсутствует адрес файла.'");
				КонецЕсли;
				
			Иначе
				Сообщение.ТекстСообщения = Оповещение.messageData.textMessageData.textMessage;
			КонецЕсли;
			
			Если Не Отказ Тогда
				МассивСообщений.Добавить(Сообщение);
			КонецЕсли;

		КонецЕсли;

		Если Не Отказ Тогда
			Адрес = URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL,
				 СтруктураПараметровДоступа.Токен, "deleteNotification") + "/" 
				+ idОповещения;
				
				Попытка
					Ответ = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер,
					, Адрес, СтруктураПараметровДоступа.ПараметрыПрокси, "",
					Истина));
				Исключение 
					ЗаписьЖурналаРегистрации(CRM_РаботаСМессенджерамиСервер.СобытиеЖурналаРегистрации(), 
					УровеньЖурналаРегистрации.Ошибка, , , 
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

					// Если не удалось удалить сообщение из сервиса
					// удалить последнее сообщение из массива ,чтобы исключить дублирование
					УдалитьПоследнееСообщение(МассивСообщений);
					Возврат; 
				КонецПопытки;
		КонецЕсли;
		
		Попытка
			СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер,
			"", Ресурс, СтруктураПараметровДоступа.ПараметрыПрокси,
			""));
		Исключение
			ЗаписьЖурналаРегистрации(CRM_РаботаСМессенджерамиСервер.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат; 	
		КонецПопытки;
		
	КонецЦикла;
	
	Если ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("error") Тогда
		Если ЗначениеЗаполнено(СтруктураОтвета.error) Тогда
			ВызватьИсключение СтруктураОтвета.error;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура УдалитьПоследнееСообщение(МассивСообщений)
	ВерхняяГраница = МассивСообщений.ВГраница();
	Если ВерхняяГраница <> -1 Тогда 
		МассивСообщений.Удалить(ВерхняяГраница);
	КонецЕсли;
КонецПроцедуры

Процедура ОжиданиеСобытийGreen(УчетнаяЗапись, СтруктураПараметровДоступа)

	Сервер = СерверGreen();
	Ресурс = URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL, СтруктураПараметровДоступа.Токен,
		 "receiveNotification");
	
	ТипыУведомлений = Новый Структура;
	ТипыУведомлений.Вставить("ВходящееСообщение", "incomingMessageReceived");
	ТипыУведомлений.Вставить("ИсходящееСообщение", "outgoingMessageReceived"); // Отправленное с телефона сообщение
	ТипыУведомлений.Вставить("СтатусОтправленногоСообщения", "outgoingMessageStatus");
	ТипыУведомлений.Вставить("СостояниеАккаунта", "stateInstanceChanged");
	ТипыУведомлений.Вставить("СостояниеТелефона", "deviceInfo");

	Ошибок = 0;
	Пока Ошибок < 5 Цикл
		СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер,
			 "", Ресурс, СтруктураПараметровДоступа.ПараметрыПрокси,
			 ""));
		Если ТипЗнч(СтруктураОтвета) <> Тип("Структура") Тогда
			Продолжить;
		ИначеЕсли СтруктураОтвета.Свойство("error") Тогда
			Если ЗначениеЗаполнено(СтруктураОтвета.error) Тогда
				ВызватьИсключение СтруктураОтвета.error;
			КонецЕсли;
		ИначеЕсли СтруктураОтвета.Свойство("failed") Тогда
			Ошибок = Ошибок + 1;
		Иначе
			
			ТекстСообщения = Неопределено;
			idОповещения = Формат(СтруктураОтвета.receiptId, "ЧГ=0");
			
			Отказ = Ложь;
			Оповещение = СтруктураОтвета.body;
			
			ЭтоВходящееСообщение = (Оповещение.typeWebhook = ТипыУведомлений.ВходящееСообщение);
			ЭтоИсходящееСообщение  = (Оповещение.typeWebhook = ТипыУведомлений.ИсходящееСообщение);
			
			Если ЭтоВходящееСообщение Или ЭтоИсходящееСообщение Тогда
				МассивСообщений = Новый Массив;
				Сообщение = CRM_РаботаСМессенджерамиСервер.СтруктураСообщенияМесенджера();
				Сообщение.Дата = МестноеВремя(Дата(1970, 1, 1) + Оповещение.timestamp);

				Если ЭтоВходящееСообщение Тогда
					user_id = Оповещение.senderData.sender;
				ИначеЕсли ЭтоИсходящееСообщение Тогда
					user_id = Оповещение.senderData.chatId;
				КонецЕсли;
				
				Контакт = CRM_РаботаСМессенджерамиСерверПовтИсп.НайтиКонтактПоКонтактнойИнформации(ПредставлениеКонтактнойИнформацииПользователя(user_id),
						УчетнаяЗапись, Перечисления.ТипыКонтактнойИнформации.Телефон);
				ИмяПользователя = Оповещение.senderData.senderName;
				Сообщение.ID_Сообщения = Оповещение.idMessage;
				
				Если ЭтоВходящееСообщение Тогда
					Сообщение.ВидСообщения = "Входящее";
				ИначеЕсли ЭтоИсходящееСообщение Тогда
					Сообщение.ВидСообщения = "Исходящее";
				КонецЕсли;
				
				Сообщение.ID_Пользователя = user_id;
				Сообщение.Группа = user_id;
				Если ЗначениеЗаполнено(Контакт) Тогда
					Сообщение.Контакт = Контакт;
				КонецЕсли;
				
				Если ЭтоВходящееСообщение Тогда
					Сообщение.КонтактПредставление = ИмяПользователя;
				ИначеЕсли ЭтоИсходящееСообщение Тогда
					
					Если ТипЗнч(Контакт) <> Тип("Строка") Тогда
						Сообщение.КонтактПредставление = Строка(Контакт);
					Иначе
						Сообщение.КонтактПредставление = Контакт;
					КонецЕсли;
					
				КонецЕсли;
				
				Если Оповещение.messageData.typeMessage = "quotedMessage"
					 И Оповещение.messageData.extendedTextMessageData.Свойство("stanzaId") Тогда
					Сообщение.ID_СообщенияОснования = Оповещение.messageData.extendedTextMessageData.stanzaId;
				КонецЕсли;
				
				Если Оповещение.messageData.typeMessage = "imageMessage"
					Или Оповещение.messageData.typeMessage = "videoMessage"
					Или Оповещение.messageData.typeMessage = "documentMessage"
					Или Оповещение.messageData.typeMessage = "audioMessage" Тогда
					
					Если Оповещение.messageData.typeMessage = "documentMessage" Тогда
						ИмяФайла = Оповещение.messageData.fileMessageData.fileName;
					Иначе
						ИмяФайла = "";
					КонецЕсли;
					ПараметрыФайла = СкачатьФайлПоСсылке(Оповещение.messageData.fileMessageData.downloadUrl, ИмяФайла);
					Сообщение.Вложения.Добавить(ПараметрыФайла);

					Если Оповещение.messageData.fileMessageData.Свойство("caption") Тогда
						Сообщение.ТекстСообщения = Оповещение.messageData.fileMessageData.caption;
					КонецЕсли;
				ИначеЕсли Оповещение.messageData.Свойство("extendedTextMessageData") Тогда
					ТемпТекст = "";
					Если Оповещение.messageData.extendedTextMessageData.Свойство("title") Тогда
						ТемпТекст = ТемпТекст + Оповещение.messageData.extendedTextMessageData.title;
					КонецЕсли;
					Если Оповещение.messageData.extendedTextMessageData.Свойство("text") Тогда
						ТемпТекст = ТемпТекст + Символы.ПС + Оповещение.messageData.extendedTextMessageData.text;
					КонецЕсли;
					Если Оповещение.messageData.extendedTextMessageData.Свойство("jpegThumbnail")
						И ЗначениеЗаполнено(Оповещение.messageData.extendedTextMessageData.jpegThumbnail) Тогда
						ПараметрыФайла = ФайлJpegПоДанным(Оповещение.messageData.extendedTextMessageData.jpegThumbnail);
						Сообщение.Вложения.Добавить(ПараметрыФайла);
					КонецЕсли;
					Сообщение.ТекстСообщения = ТемпТекст;
				Иначе
					Сообщение.ТекстСообщения = Оповещение.messageData.textMessageData.textMessage;
				КонецЕсли;
				
				Если Не Отказ Тогда
					МассивСообщений.Добавить(Сообщение);
				КонецЕсли;

				CRM_РаботаСМессенджерамиСервер.СоздатьСообщенияИзПолученныхДанных(УчетнаяЗапись, МассивСообщений);
			КонецЕсли;

			Если Не Отказ Тогда
				Адрес = URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL,
					 СтруктураПараметровДоступа.Токен, "deleteNotification") + "/" 
					+ idОповещения;
				Ответ = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер,
					 , Адрес, СтруктураПараметровДоступа.ПараметрыПрокси, "",
					 Истина));
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция СкачатьФайлПоСсылке(downloadUrl, ИмяФайла)
	
	ЧастиАдреса = РазбитьURL(downloadUrl);
	Хост = ЧастиАдреса.Хост;
	Адрес = ЧастиАдреса.ОтносительныйАдрес;
	
	Сертификат = Новый ЗащищенноеСоединениеOpenSSL(, Новый СертификатыУдостоверяющихЦентровОС);
	Соединение = Новый HTTPСоединение(Хост, , , , , 20, Сертификат);

	ВебЗапрос = Новый HTTPЗапрос(Адрес);
	Ответ = Соединение.Получить(ВебЗапрос);
	Если Ответ.КодСостояния = 200 Тогда
		Если ИмяФайла = "" Тогда
			РасширениеФайла = CRM_РаботаСМессенджерамиСерверПовтИсп.РасширениеПоТипуMIME(Ответ.Заголовки["Content-Type"]);
			Если РасширениеФайла = Неопределено Тогда
				РасширениеФайла = "";
			КонецЕсли;
			ИмяФайла = Строка(Новый УникальныйИдентификатор()) + "." + РасширениеФайла;
		КонецЕсли;
		
		Данные = Ответ.ПолучитьТелоКакДвоичныеДанные();
		АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(Данные);
		ПараметрыФайла = Новый Структура;
		ПараметрыФайла.Вставить("ВладелецФайлов", Неопределено);
		ПараметрыФайла.Вставить("Автор", Неопределено);
		ПараметрыФайла.Вставить("ИмяБезРасширения", Лев(ИмяФайла, СтрНайти(ИмяФайла, ".") - 1));
		ПараметрыФайла.Вставить("РасширениеБезТочки", Сред(ИмяФайла, СтрНайти(ИмяФайла, ".") + 1));
		ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
		ПараметрыФайла.Вставить("АдресФайлаВХранилище", АдресФайлаВХранилище);
		Возврат ПараметрыФайла;
	Иначе
		ТекстОшибки = Ответ.ПолучитьТелоКакСтроку("UTF-8");
		ВызватьИсключение СтрШаблон("Сервер вернул статус %1. 
		|%2", Ответ.КодСостояния, ТекстОшибки);
	КонецЕсли;
	
КонецФункции

Функция ФайлJpegПоДанным(ФайлСтрокой)
	
	Данные = Base64Значение(ФайлСтрокой);
	АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(Данные);
	ПараметрыФайла = Новый Структура;
	ПараметрыФайла.Вставить("ВладелецФайлов", Неопределено);
	ПараметрыФайла.Вставить("Автор", Неопределено);
	ПараметрыФайла.Вставить("ИмяБезРасширения", Строка(Новый УникальныйИдентификатор()));
	ПараметрыФайла.Вставить("РасширениеБезТочки", "jpg");
	ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
	ПараметрыФайла.Вставить("АдресФайлаВХранилище", АдресФайлаВХранилище);
	Возврат ПараметрыФайла;
	
КонецФункции

Функция РазбитьURL(УРЛ)
	ЧастиУРЛ = СтрРазделить(УРЛ, "//", Ложь);
	Хост = ЧастиУРЛ[1];
	ЧастиУРЛ.Удалить(0); // протокол https
	ЧастиУРЛ.Удалить(0); // имя хоста
	ОтносительныйАдрес = СтрСоединить(ЧастиУРЛ, "/");
	
	Возврат Новый Структура("Хост, ОтносительныйАдрес", Хост, ОтносительныйАдрес);
	
КонецФункции

Функция СерверGreen() Экспорт
	Возврат "api.green-api.com";
КонецФункции

Функция URLМетодаСервисаGreen(Инстанс, Токен, Метод) Экспорт
	Возврат СтрШаблон("waInstance%1/%2/%3", Инстанс, Метод, Токен);
КонецФункции

Функция УстановитьWebhookGreen(УчетнаяЗапись, СтруктураПараметровДоступа) Экспорт
	
	Если ЗначениеЗаполнено(СтруктураПараметровДоступа.АдресWebhook) Тогда
		АдресWebhook = СтруктураПараметровДоступа.АдресWebhook;
		АдресWebhook = АдресWebhook + ?(Прав(АдресWebhook, 1) = "/", "", "/") 
			+ Строка(УчетнаяЗапись.Ссылка.УникальныйИдентификатор());
	Иначе
		АдресWebhook = "";
	КонецЕсли;
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("webhookUrl", АдресWebhook);
	СтруктураНастроек.Вставить("incomingWebhook", "yes");
	СтруктураНастроек.Вставить("outgoingWebhook", "yes");
	СтруктураНастроек.Вставить("deviceWebhook", "yes");
	СтруктураНастроек.Вставить("stateWebhook", "yes");
	СтруктураНастроек.Вставить("markIncomingMessagesReaded", "no");
	СтруктураНастроек.Вставить("outgoingMessageWebhook", "yes");
	
	СтрокаЗапроса = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(СтруктураНастроек, Истина);
	
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(СерверGreen(),
		 СтрокаЗапроса
		, URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL, СтруктураПараметровДоступа.Токен, "setSettings"), СтруктураПараметровДоступа.ПараметрыПрокси));
		
	Если СтруктураОтвета.Свойство("saveSettings")	Тогда
		Возврат СтруктураОтвета.saveSettings;
	Иначе       
		ТекстОшибки = (?(СтруктураОтвета.Свойство("error"), "Не удалось сохранить настройки по причине : " + СтруктураОтвета.error,
			 "Не удалось сохранить настройки!"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ОбработатьWebhookGreen(УчетнаяЗапись, ТелоЗапроса, СтруктураПараметровДоступа) Экспорт
	
	ТипыУведомлений = Новый Структура;
	ТипыУведомлений.Вставить("ВходящееСообщение", "incomingMessageReceived");
	ТипыУведомлений.Вставить("ИсходящееСообщение", "outgoingMessageReceived"); // Отправленное с телефона сообщение
	ТипыУведомлений.Вставить("СтатусОтправленногоСообщения", "outgoingMessageStatus");
	ТипыУведомлений.Вставить("СостояниеАккаунта", "stateInstanceChanged");
	ТипыУведомлений.Вставить("СостояниеТелефона", "deviceInfo");
	
	Оповещение = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(ТелоЗапроса);
	
	ЭтоВходящееСообщение = (Оповещение.typeWebhook = ТипыУведомлений.ВходящееСообщение);
	ЭтоИсходящееСообщение  = (Оповещение.typeWebhook = ТипыУведомлений.ИсходящееСообщение);
	
	Отказ = Ложь;
	Если ЭтоВходящееСообщение Или ЭтоИсходящееСообщение Тогда
		МассивСообщений = Новый Массив;
		Сообщение = CRM_РаботаСМессенджерамиСервер.СтруктураСообщенияМесенджера();
		Сообщение.Дата = МестноеВремя(Дата(1970, 1, 1) + Оповещение.timestamp);
		
		Если ЭтоВходящееСообщение Тогда
			user_id = Оповещение.senderData.sender;
		ИначеЕсли ЭтоИсходящееСообщение Тогда
			user_id = Оповещение.senderData.chatId;
		КонецЕсли;
		
		Контакт = CRM_РаботаСМессенджерамиСерверПовтИсп.НайтиКонтактПоКонтактнойИнформации(ПредставлениеКонтактнойИнформацииПользователя(user_id),
			УчетнаяЗапись, Перечисления.ТипыКонтактнойИнформации.Телефон);
		ИмяПользователя = Оповещение.senderData.senderName;
		Сообщение.ID_Сообщения = Оповещение.idMessage;
		
		Если ЭтоВходящееСообщение Тогда
			Сообщение.ВидСообщения = "Входящее";
		ИначеЕсли ЭтоИсходящееСообщение Тогда
			Сообщение.ВидСообщения = "Исходящее";
		КонецЕсли;
		
		Сообщение.ID_Пользователя = user_id;
		Сообщение.Группа = user_id;
		Если ЗначениеЗаполнено(Контакт) Тогда
			Сообщение.Контакт = Контакт;
		КонецЕсли;
		
		Если ЭтоВходящееСообщение Тогда
			Сообщение.КонтактПредставление = ИмяПользователя;
		ИначеЕсли ЭтоИсходящееСообщение Тогда
			Если ТипЗнч(Контакт) <> Тип("Строка") Тогда
				Сообщение.КонтактПредставление = Строка(Контакт);
			Иначе
				Сообщение.КонтактПредставление = Контакт;
			КонецЕсли;
		КонецЕсли;
		
		Если Оповещение.messageData.typeMessage = "quotedMessage" Тогда
			Сообщение.ID_СообщенияОснования = Оповещение.messageData.extendedTextMessageData.stanzaId;
		КонецЕсли;
		
		Если Оповещение.messageData.typeMessage = "textMessage" Тогда
			Сообщение.ТекстСообщения = Оповещение.messageData.textMessageData.textMessage;
			
		ИначеЕсли Оповещение.messageData.typeMessage = "imageMessage"
			Или Оповещение.messageData.typeMessage = "videoMessage"
			Или Оповещение.messageData.typeMessage = "documentMessage"
			Или Оповещение.messageData.typeMessage = "audioMessage" Тогда
			
			Если Оповещение.messageData.typeMessage = "documentMessage" Тогда
				ИмяФайла = Оповещение.messageData.fileMessageData.fileName;
			Иначе
				ИмяФайла = "";
			КонецЕсли;
			ПараметрыФайла = СкачатьФайлПоСсылке(Оповещение.messageData.fileMessageData.downloadUrl, ИмяФайла);
			Сообщение.Вложения.Добавить(ПараметрыФайла);
			
			Если Оповещение.messageData.fileMessageData.Свойство("caption") Тогда
				Сообщение.ТекстСообщения = Оповещение.messageData.fileMessageData.caption;
			КонецЕсли;
				ИначеЕсли Оповещение.messageData.Свойство("extendedTextMessageData") Тогда
			ТемпТекст = "";
			Если Оповещение.messageData.extendedTextMessageData.Свойство("title") Тогда
				ТемпТекст = ТемпТекст + Оповещение.messageData.extendedTextMessageData.title;
			КонецЕсли;
			Если Оповещение.messageData.extendedTextMessageData.Свойство("text") Тогда
				ТемпТекст = ТемпТекст + Символы.ПС + Оповещение.messageData.extendedTextMessageData.text;
			КонецЕсли;
			Если Оповещение.messageData.extendedTextMessageData.Свойство("jpegThumbnail")
				И ЗначениеЗаполнено(Оповещение.messageData.extendedTextMessageData.jpegThumbnail) Тогда
				ПараметрыФайла = ФайлJpegПоДанным(Оповещение.messageData.extendedTextMessageData.jpegThumbnail);
				Сообщение.Вложения.Добавить(ПараметрыФайла);
			КонецЕсли;
			Сообщение.ТекстСообщения = ТемпТекст;
		ИначеЕсли Оповещение.messageData.typeMessage = "contactMessage" Тогда
			Сообщение.ТекстСообщения = Оповещение.messageData.contactMessageData.vcard;
			
		ИначеЕсли Оповещение.messageData.typeMessage = "contactsArrayMessage" Тогда
			
			МассивКонтактов = Оповещение.messageData.messageData.contacts;
			МассивСообщенийКонтактов = Новый Массив;
			Для Каждого ТекКонтакт Из МассивКонтактов Цикл
				МассивСообщенийКонтактов.Добавить(ТекКонтакт.displayName);
				МассивСообщенийКонтактов.Добавить(ТекКонтакт.vcard);
				МассивСообщенийКонтактов.Добавить("");
			КонецЦикла;
			
			Сообщение.ТекстСообщения = СтрСоединить(МассивСообщенийКонтактов, Символы.ПС);
			
		ИначеЕсли Оповещение.messageData.typeMessage = "locationMessage" Тогда	
			Сообщение.ТекстСообщения    = СтрШаблон("https://yandex.ru/maps/?pt=%1,%2&z=18&l=map"
			, Формат(Оповещение.messageData.locationMessageData.longitude, "ЧРД=.")
			, Формат(Оповещение.messageData.locationMessageData.latitude, "ЧРД=." ));
			
		ИначеЕсли Оповещение.messageData.typeMessage = "templateMessage" Тогда // сообщение с шаблонными кнопками 
			Сообщение.ТекстСообщения = Оповещение.messageData.templateMessage.contentText;
			
		ИначеЕсли Оповещение.messageData.typeMessage = "buttonsMessage" Тогда // сообщение с кнопками 
			Сообщение.ТекстСообщения = Оповещение.messageData.buttonsMessage.contentText;
			
		ИначеЕсли Оповещение.messageData.typeMessage = "stickerMessage" Тогда
			ПозицияПоследнегоРазделителя = СтрНайти(Оповещение.messageData.fileMessageData.downloadUrl, "/",
				 НаправлениеПоиска.СКонца);
			ИмяФайла = Прав(Оповещение.messageData.fileMessageData.downloadUrl,
				 СтрДлина(Оповещение.messageData.fileMessageData.downloadUrl) - ПозицияПоследнегоРазделителя); 
			
			Если Не ПустаяСтрока(Оповещение.messageData.fileMessageData.downloadUrl) Тогда
				ПараметрыФайла = СкачатьФайлПоСсылке(Оповещение.messageData.fileMessageData.downloadUrl, ИмяФайла);
				Сообщение.Вложения.Добавить(ПараметрыФайла);
			Иначе
				Сообщение.ТекстСообщения = НСтр("ru = 'Ошибка загрузки стикера! В сообщении отсутствует адрес файла.'");
			КонецЕсли;
			
		Иначе
			Сообщение.ТекстСообщения = СтрШаблон("Неизвестный тип сообщения: %1", Оповещение.messageData.typeMessage);
		КонецЕсли;
		
		Если Не Отказ Тогда
			МассивСообщений.Добавить(Сообщение);
		КонецЕсли;
		
		CRM_РаботаСМессенджерамиСервер.СоздатьСообщенияИзПолученныхДанных(УчетнаяЗапись, МассивСообщений);
	КонецЕсли;
	
	ДанныеОтвета = Новый Структура("status", "ок");
	Ответ = CRM_РаботаСМессенджерамиСервер.HTTPОтвет(ДанныеОтвета);
	Возврат Ответ;
	
КонецФункции

Процедура ПометитьКакПрочтенныеGreen(СтруктураПараметровДоступа, МассивСообщений) Экспорт
	
	Возврат; // Функция не работает в GreenApi
	
	Сервер = СерверGreen();
	Ресурс = URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL, СтруктураПараметровДоступа.Токен, "ReadChat");

	Сообщение = МассивСообщений[МассивСообщений.ВГраница()];
	Структура = Новый Структура;
	Структура.Вставить("chatId", Сообщение.Группа);
	Структура.Вставить("idMessage", Сообщение.ID_Сообщения);
	СтрокаЗапроса = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(Структура, Истина);
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер,
		 СтрокаЗапроса, Ресурс,
		 СтруктураПараметровДоступа.ПараметрыПрокси));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error;
	КонецЕсли;
	
КонецПроцедуры

Функция ПользовательДоступенGreen(УчетнаяЗапись, НомерТелефона, СтруктураПараметровДоступа) Экспорт
	
	Результат = Новый Структура("Доступен, Описание", Ложь, "");
	
	Сервер = СерверGreen();
	Ресурс = URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL, СтруктураПараметровДоступа.Токен, "checkWhatsapp");

	Структура = Новый Структура;
	Структура.Вставить("phoneNumber", НомерТелефона);
	
	СтрокаЗапроса = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(Структура);
	
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер,
		 СтрокаЗапроса, Ресурс,
		 СтруктураПараметровДоступа.ПараметрыПрокси));
	Если СтруктураОтвета.Свойство("error") Тогда
		ШаблонОписания = НСтр("ru = 'Результат поиска в мессенджерах номера %1 от учетной записи %2: %3'");
		Результат.Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОписания,
			 НомерТелефона, УчетнаяЗапись,
			 СтруктураОтвета.error);
		Возврат Результат;
	КонецЕсли;
	
	Результат.Доступен = Истина;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
